note/note-tmux.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-01-24 Thu 21:14 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>tmux + ssh 管理远程会话</title>
<meta name="generator" content="Org mode">
<meta name="author" content="manue1">
<link rel="stylesheet" type="text/css" href="css/worg.css" />
<!-- <link rel="shortcut icon" href="http://www.langdebuqing.com/images/favicon.ico" type="image/x-icon" /> -->
</head>
<body>
<div id="preamble" class="status">
<div id="navbar">
    <ul>
        <li id="site-master"><a href="https://www.manue1.site/">Manue1's Journal</a></li>
        <li><a class="navbar-item" href="https://www.manue1.site/write.html">All Posts</a> </li>
        <li><a class="navbar-item" href="https://www.manue1.site/link.html">Links</a> </li>
        <li class="search">
            <form action="http://google.com/search" method="get" accept-charset="utf-8">
                <input type="search" id="search" name="q" autocomplete="off" maxlength="30" placeholder="Search..">
                <input type="hidden" name="q" value="site:www.manue1.com">
            </form>
        </li>
    </ul>
</div>
</div>
<div id="content">
<h1 class="title">tmux + ssh 管理远程会话</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbffdab3">1. tmux use</a>
<ul>
<li><a href="#orga9e117e">1.1. install</a></li>
<li><a href="#org96f5295">1.2. <span class="todo TODO">TODO</span> embellish terminal</a></li>
<li><a href="#org45facc2">1.3. use tmux</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgbffdab3" class="outline-2">
<h2 id="orgbffdab3"><span class="section-number-2">1</span> tmux use</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Server 服务器 tmux开启一个服务器,用来管理多个会话<br></li>

<li>Session 会话,一组窗口的集合 session可以有自己的名字<br></li>

<li>Window 单个可见窗口 window有自己的编号<br></li>

<li>Pane 被划分成小块的窗格<br></li>
</ul>
</div>
<div id="outline-container-orga9e117e" class="outline-3">
<h3 id="orga9e117e"><span class="section-number-3">1.1</span> install</h3>
<div class="outline-text-3" id="text-1-1">
<p>
sudo apt-get install tmux<br>
</p>
</div>
</div>

<div id="outline-container-org96f5295" class="outline-3">
<h3 id="org96f5295"><span class="section-number-3">1.2</span> <span class="todo TODO">TODO</span> embellish terminal</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>State "TODO"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2017-10-10 Tue 13:37]</span></span><br></li>
</ul>
<p>
<a href="http://hit9.github.io/oldblog/blog/other/posts/11.html">powerline use:</a><br>
</p>
</div>
</div>

<div id="outline-container-org45facc2" class="outline-3">
<h3 id="org45facc2"><span class="section-number-3">1.3</span> use tmux</h3>
<div class="outline-text-3" id="text-1-3">
<p>
[[<a href="http://kuanghy.github.io/2016/09/29/tmux">http://kuanghy.github.io/2016/09/29/tmux</a>][how to use tmux]<br>
</p>


<p>
<a href="https://tmuxcheatsheet.com/">https://tmuxcheatsheet.com/</a><br>
</p>

<p>
prefix = c-b<br>
</p>

<p>
Session相关操作<br>
</p>

<p>
查看/切换session prefix s<br>
离开Session prefix d<br>
重命名当前Sessionprefix $<br>
</p>

<p>
Window相关操作<br>
</p>

<p>
新建窗口prefix c<br>
切换到上一个活动的窗口prefix space<br>
关闭一个窗口prefix &amp;<br>
使用窗口号切换prefix 窗口号<br>
</p>

<p>
Pane 相关操作<br>
</p>

<p>
切换到下一个窗格prefix o<br>
查看所有窗格的编号prefix q<br>
垂直拆分出一个新窗格prefix “<br>
水平拆分出一个新窗格prefix %<br>
暂时把一个窗体放到最大prefix z<br>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>
    <a href="">manue1</a> 搭建和维护，使用
    <a href="https://www.gnu.org/software/emacs/">Emacs</a>
    <a href="http://orgmode.org/">Org mode</a> 编辑和构建
</p>
<script src="http://www.langdebuqing.com/css/jquery-2.1.3.min.js"></script>
<script src="http://www.langdebuqing.com/css/main.js"></script>
</div>
</body>
</html>